Repository: alekssamos/cloudvision
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, es, fi, pt_br, ru, tr

source: You are logged in to your account:
ar: لقد قمت بتسجيل الدخول إلى حسابك:
fi: Olet kirjautunut tilillesi:
ru: Вы авторизованы в аккаунте:
tr: Hesabınızda oturum açtınız:

source: Email:
ar: البريد الإلكتروني:
fi: &Sähköposti:
ru: Почта:
tr: E-posta:

source: Password:
ar: كلمة المرور:
fi: S&alasana:
ru: Пароль:
tr: Parola:

source: Recover
fi: Palauta
ru: Восстановить

source: Log in
ar: تسجيل الدخول
fi: &Kirjaudu sisään
ru: Войти
tr: Giriş yap

source: Create account
ar: إنشاء حساب
fi: &Luo tili
ru: Создать аккаунт
tr: Hesap oluştur

source: Enter your email address here and click on the button to reset your password.
fi: Syötä tähän sähköpostiosoitteesi ja nollaa salasanasi painamalla painiketta.
ru: Введите вашу электронную почту и нажмите на кнопку для сброса пароля.

source: A link has been sent to your email. Click on it, set a new password in the form, and then enter the password here.
fi: Sähköpostiisi on lähetetty linkki. Napsauta sitä, luo lomakkeessa uusi salasana ja syötä se tähän.
ru: На ваш электронный адрес была отправлена ссылка. Нажмите на нее, задайте новый пароль в форме, а затем введите пароль здесь.

source: Logout
ar: تسجيل الخروج
fi: Kirjaudu &ulos
ru: Выход из аккаунта
tr: Oturumu kapat

source: Name:
ar: الإسم:
fi: Etu&nimi:
ru: Имя:
tr: Adınız:

source: Surname:
ar: اسم العائلة:
fi: Suk&unimi:
ru: Фамилия:
tr: Soyadınız:

source: Register
ar: تسجيل
fi: Re&kisteröidy
ru: Регистрация
tr: Kayıt ol

source: Question:
ar: سؤال:
fi: &Kysymys:
ru: Вопрос:
tr: Sorunuz:

source: Send
ar: إرسال
fi: &Lähetä
ru: Отправить
tr: Gönder

source: Close
ar: إغلاق
fi: &Sulje
ru: Закрыть
tr: Kapat

source: Wait for the Bot to type the message
fi: Odota, kun botti kirjoittaa viestiä
ru: Подождите, пока бот напишет сообщение

source: You
ar: أنت
fi: Sinä
ru: Вы
tr: Siz

source: First you need to log in or register
ar: أولا تحتاج إلى تسجيل الدخول أو إنشاء حساب
fi: Sinun täytyy ensin kirjautua sisään tai rekisteröityä.
ru: Сначала вам нужно войти в систему или зарегистрироваться
tr: Öncelikle giriş yapmanız veya kayıt olmanız gerekiyor

source: Open NVDA Menu, Preferences, CloudVision Settings, Manage Be My Eyes account
ar: قم بفتح قائمة NVDA, تفضيلات, CloudVision الإعدادات, إدارة حساب Be My Eyes
fi: Avaa NVDA-valikko ja sitten Mukautukset > Pilvinäön asetukset ja valitse Be My Eyes -tilin hallinta.
ru: Откройте NVDA меню, Параметры, настройки CloudVision, управление аккаунтом Be My Eyes
tr: NVDA Menüsü, Tercihler, CloudVision Ayarları, Be My Eyes hesabını yönet

source: Brief
fi: Lyhyt
ru: Краткие

source: Detailed
fi: Yksityiskohtainen
ru: Подробные

source: Your prompt
fi: Oma kehote
ru: Ваш промпт

source: File not supported
ar: ملف غير مدعوم
es: Archivo no compatible
fi: Tiedostoa ei tueta
pt_br: Este arquivo não é suportado
ru: Файл не поддерживается
tr: Dosya desteklenmiyor

source: There is no image in the clipboard
fi: Leikepöydällä ei ole kuvaa
ru: В буфере обмена нет изображения

source: Analyzing selected file
ar: يجري تحليل الملف المحدد
es: Analizando el archivo seleccionado
fi: Analysoidaan valittua tiedostoa
pt_br: Analisando o arquivo selecionado
ru: Идет анализ выбранного файла
tr: Seçilen dosya analiz ediliyor

source: Please disable screen curtain before using CloudVision add-on.
ar: يرجى تعطيل ستار الشاشة قبل استخدام إضافة CloudVision.
es: Desactive la cortina de pantalla antes de utilizar el complemento CloudVision.
fi: Poista näyttöverho käytöstä ennen Pilvinäkö-lisäosan käyttämistä.
pt_br: Não é possível usar o complemento CloudVision com a cortina de tela ativada, desative-a antes de usar.
ru: Пожалуйста, отключите затемнение экрана перед использованием дополнения CloudVision.
tr: Lütfen CloudVision eklentisini kullanmadan önce ekran perdesini devre dışı bırakın.

source: Analyzing navigator object
ar: يجري تحليل الكائن
es: Analizando navegador de objetos
fi: Analysoidaan navigointiobjektia
pt_br: Analisando o objeto do navegador
ru: Идет анализ объекта навигатора
tr: Nesne analiz ediliyor

source: Analyzing full screen
fi: Analysoidaan koko ruutu
ru: Идет анализ всего экрана

source: Analyzing image from clipboard
fi: Analysoidaan kuvaa leikepöydältä
ru: Идет анализ изображения из буфера обмена

source: Analyzing the active window
fi: Analysoidaan aktiivista ikkunaa
ru: Идет анализ активного окна

source: CloudVision Settings
ar: إعدادات CloudVision
es: Configuración de CloudVision
fi: Pilvinäön asetukset
pt_br: Configurações do CloudVision
ru: Настройки CloudVision
tr: CloudVision Ayarları

source: Pre&fer a navigator object instead of a file
ar: تفضيل كائن بدلاً من ملف
fi: Aseta &navigointiobjekti etusijalle
pt_br: Prefirir um objeto de navegador ao invés de um arquivo
ru: Пр&едпочитать объект навигатора вместо файла
tr: &Dosya yerine gezgin nesnesini tercih et

source: &Play sound during recognition
ar: تشغيل الصوت أثناء التعرف
es: &Reproducir sonido durante el reconocimiento
fi: Toi&sta ääni tunnistuksen aikana
pt_br: Reproduzir um som durante o reconhecimento
ru: &Воспроизводить звук во время распознавания
tr: &Tanıma sırasında ses çal

source: off
fi: ei käytössä
ru: Выключено

source: tones
fi: merkkiäänet
ru: Сигналы

source: melody
fi: melodia
ru: Мелодия

source: Recognize &text
ar: التعرف على النص
es: Reconocer y enviar mensajes de texto
fi: Tunnista t&eksti
pt_br: Reconhecer textos
ru: Распознавать &текст
tr: &Metni tanı

source: Recognize &images
ar: التعرف على الصور
es: Reconocer imágenes
fi: Tunnista &kuvat
pt_br: reconhecer imagens
ru: Распознавать &образы
tr: &Resimleri tanı

source: What descriptions will be requested?
fi: Millainen kuvaus pyydetään?
ru: Какие описания запрашивать?

source: Manage Be My Eyes account
ar: إدارة حساب Be My Eyes
fi: Be My E&yes -tilin hallinta
ru: Управление аккаунтом BM
tr: Be My Eyes hesabını yönet

source: Read &QR / bar code
ar: قراءة QR / bar code
es: Leer &QR/código de barras
fi: Lue &QR- tai viivakoodi
pt_br: Ler QR codes
ru: Читать &QR / bar коды
tr: &QR / barkodu oku

source: Translate text
ar: ترجمة النص
es: Traducir texto
fi: Käännä teksti
pt_br: traduzir textos
ru: Перевод текста
tr: Metni çevir

source: Use &Mathpix for math formulas recognition
ar: استخدام &Mathpix للتعرف على الصيغ الرياضية
es: &Usar Mathpix para el reconocimiento de fórmulas matemáticas
fi: Käytä &Mathpixiä matemaattisten kaavojen tunnistamiseen
pt_br: &Usar Mathpix para reconhecimento de fórmulas matemáticas
ru: &Использовать Mathpix для распознавания математических формул
tr: &Matematik formüllerini tanımak için Mathpix kullan

source: Mathpix API &Key:
ar: مفتاح API لـ &Mathpix:
es: Clave de API de &Mathpix:
fi: Mat&hpixin API-avain:
pt_br: Chave de API do &Mathpix:
ru: &Ключ API Mathpix:
tr: Mathpix API &anahtarı:

source: Select image description language, other languages than english are more prone to translation errors
ar: حدد لغة وصف الصورة، قد تكون اللغات الأخرى غير الإنجليزية أكثر عرضة للأخطاء عند الترجمة
es: Seleccione el idioma de descripción de la imagen, otros idiomas además del inglés son más propensos a errores de traducción
fi: Valitse kuvien kuvauksen kieli (muut kuin englanti ovat alttiimpia käännösvirheille)
pt_br: Selecione o idioma de tradução da imagem (idiomas diferentes do inglês são mais propensos a erros)
ru: Выберите язык описания изображения,vдругие языки, кроме английского, более подвержены ошибкам перевода
tr: Resim açıklama dilini seçin, İngilizce dışındaki diğer diller çeviri hatalarına daha yatkındır

source: Open site
ar: فتح موقع
es: Abrir sitio
fi: Avaa siv&u
pt_br: Abrir o site
ru: Открыть сайт
tr: Siteyi aç

source: &Use proxy server
fi: Käytä v&älityspalvelinta
ru: &Использовать прокси Сервер

source: Proxy &protocol:
fi: Välityspalvelimen &protokolla:
ru: &Протокол Прокси:

source: Proxy &host:
fi: Välityspalvelimen oso&ite:
ru: &Хост прокси:

source: Proxy p&ort:
fi: Välityspalvelimen p&ortti:
ru: Прокси П&орт:

source: Proxy &login:
fi: Välityspalvelimen &käyttäjätunnus:
ru: &Логин прокси:

source: Proxy p&assword:
fi: Välityspalvelimen s&alasana:
ru: П&ароль прокси:

source: Please wait...
ar: يرجى الإنتظار...
fi: Odota...
ru: Пожалуйста, подождите...
tr: Lütfen bekleyin...

source: Error
ar: خطأ
fi: Virhe
pt_br: Erro...
ru: Ошибка
tr: Hata

source: Error saving settings
ar: خطأ في حفظ الإعدادات
es: Error al guardar la configuración
fi: Virhe tallennettaessa asetuksia
pt_br: Erro ao aplicar as configurações do CloudVision
ru: Ошибка сохранения настроек
tr: Ayarlar kaydedilirken hata oluştu

source: Mathpix API key is not set in settings
ar: لم يتم تعيين مفتاح API لـ Mathpix في الإعدادات
es: La clave API de Mathpix no está configurada en los ajustes
fi: Mathpixin API-avainta ei ole määritetty asetuksissa
pt_br: A chave API do Mathpix não está definida nas configurações
ru: Ключ API Mathpix не указан в настройках
tr: Mathpix API anahtarı ayarlarda belirtilmemiş

source: You need to log in to your account
fi: Sinun on kirjauduttava tilillesi
ru: Вам необходимо войти в свою учетную запись

source: Math formulas (Mathpix):
ar: الصيغ الرياضية (Mathpix):
es: Fórmulas matemáticas (Mathpix):
fi: Matemaattiset kaavat (Mathpix):
pt_br: Fórmulas matemáticas (Mathpix):
ru: Математические формулы (Mathpix):
tr: Matematik formülleri (Mathpix):

source: Cloud Vision settings...
ar: إعدادات Cloud Vision.
es: Configuración de cloud visión...
fi: Pilvinäön asetukset...
pt_br: configurações do CloudVision
ru: Настройки CloudVision...
tr: Cloud Vision ayarları...

source: There have been no recognitions yet
ar: لم تكن هناك أي تعرفات حتى الآن
fi: Tunnistuksia ei ole vielä suoritettu
ru: Пока не было никаких распознаваний
tr: Henüz bir tanıma gerçekleşmedi

source: To recognize files under the cursor without opening Update NVDA version to 2021.1 or higher
ar: للتعرف على الملفات الموجودة أسفل المؤشر دون فتحها قم بتحديث NVDA إلى الإصدار 2021.1 أو أعلى
es: Para reconocer archivos debajo del cursor sin abrir Actualice la versión de NVDA a 2021.1 o superior
fi: Tunnista kohdistimen kohdalla oleva tiedosto avaamatta sitä päivittämällä NVDA versioksi 2021.1 tai uudemmaksi
pt_br: Para reconhecer arquivos sem abri-los, atualize sua versão do NVDA para 2021.1 ou superior
ru: Для распознавания файлов под курсором без открытия Обновите версию NVDA до 2021.1 или выше
tr: İmleç altındaki dosyaların açılmadan tanınabilmesi için NVDA sürümünü 2021.1 veya üstü bir sürüme güncelleyin

source: No mathematical formulas found
ar: لم يتم العثور على صيغ رياضية
es: No se encontraron fórmulas matemáticas
fi: Matemaattisia kaavoja ei löydy
pt_br: Nenhuma fórmula matemática encontrada
ru: Математические формулы не найдены
tr: Matematiksel formül bulunamadı

source: CloudVision result
ar: نتيجة CloudVision
es: Resultado de CloudVision
fi: Pilvinäön tulos
pt_br: Resultado do CloudVision
ru: Результат CloudVision
tr: CloudVision sonucu

source: Mathpix result
ar: نتيجة Mathpix
es: Resultado de Mathpix
fi: Mathpixin tulos
pt_br: Resultado do Mathpix
ru: Результат Mathpix
tr: Mathpix sonucu

source: Analysis completed:
ar: اكتمل التعرف:
es: Análisis completado:
fi: Analyysi suoritettu:
pt_br: Análise concluída com sucesso
ru: Анализ завершен:
tr: Analiz tamamlandı:

source: This navigator object is not analyzable
ar: لا يمكن تحليل هذا الكائن
es: El navegador de objetos no es analizable
fi: Tätä navigointiobjektia ei voi analysoida
pt_br: Este objeto de navegação não é analisável
ru: Этот объект навигатора невозможно анализировать
tr: Bu nesne analiz edilebilir değil

source: This navigator object is too small
ar: هذا الكائن صغير جدا
es: El navegador de objetos es demasiado pequeño
fi: Tämä navigointiobjekti on liian pieni
pt_br: Este objeto de navegador é muito pequeno
ru: Этот объект навигатора слишком мал
tr: Bu gezgin nesnesi çok küçük

source: Gives a description on how current navigator object or selected file in Explorer looks like visually, if you press twice quickly, a virtual viewer will open. If Mathpix is enabled in settings, it will also recognize mathematical formulas.
ar: يقدم وصفًا بصريا لكيفية ظهور الكائن الحالي أو الملف المحدد في المستكشف، إذا قمت بالضغط مرتين بسرعة، سيتم فتح نافذة افتراضية تحتوي على النتيجة. إذا تم تمكين Mathpix في الإعدادات، سيتم أيضًا التعرف على الصيغ الرياضية.
es: Proporciona una descripción de cómo se ve visualmente el objeto del navegador actual o el archivo seleccionado en el Explorador, si presionas dos veces rápidamente, se abrirá un visor virtual. Si Mathpix está habilitado en la configuración, también reconocerá fórmulas matemáticas.
fi: Antaa kuvauksen siitä, miltä nykyinen navigointiobjekti tai Resurssienhallinnassa valittuna oleva tiedosto näyttää visuaalisesti. Kahdesti painettaessa kuvaus avataan virtuaaliseen ikkunaan. Myös matemaattiset kaavat tunnistetaan, jos Mathpix on otettu käyttöön asetuksissa.
pt_br: Fornece uma descrição da aparência do objeto do navegador ou explorador atual, se pressionado duas vezes, um visualizador virtual aparece. Se o Mathpix estiver habilitado nas configurações, também reconhecerá fórmulas matemáticas.
ru: Предоставляет описание того, как текущий объект навигатора или выбранный файл в Проводнике выглядит визуально, если нажать два раза быстро, откроется виртуальный просмотрщик. Если Mathpix включен в настройках, также будут распознаны математические формулы.
tr: Geçerli gezgin nesnesinin veya Explorer'da seçilen dosyanın görsel olarak nasıl göründüğüne ilişkin bir açıklama duyurur, hızlı bir şekilde iki kez basılırsa sanal bir görüntüleyici açılır. Ayarlarda Mathpix etkinleştirilmişse, matematiksel formülleri de tanıyacaktır.

source: Cloud Vision
fi: Pilvinäkö

source: Switching between prompts
fi: Vaihtaa kehotetta
ru: Переключение между промптами

source: Analyze the full screen. Pressing twice will open the virtual viewer.
fi: Analysoi koko ruudun. Kahdesti painettaessa tulokset avataan virtuaalisessa ikkunassa.
ru: Анализировать весь экран. При двойном нажатии откроется окно виртуального просмотра.
tr: Tam ekranı analiz eder. İki kez basıldığında sanal görüntüleyici açılacaktır.

source: Analyze the active window. Pressing twice will open the virtual viewer.
fi: Analysoi aktiivisen ikkunan. Kahdesti painettaessa tulokset avataan virtuaalisessa ikkunassa.
ru: Анализировать активное окно. При двойном нажатии откроется окно виртуального просмотра.

source: Couldn't save image from clipboard
fi: Kuvaa ei voitu tallentaa leikepöydältä
ru: Не удалось сохранить изображение из буфера обмена

source: Analyzing an image from the clipboard. Pressing twice will open the virtual viewer.
fi: Analysoi leikepöydällä olevan kuvan. Kahdesti painettaessa tulokset avataan virtuaalisessa ikkunassa.
ru: Анализировать изображение из буфера обмена. При двойном нажатии откроется окно виртуального просмотра.

source: Text Not Found.
ar: لم يتم العثور على النص.
es: Texto no encontrado.
fi: Tekstiä ei löydy.
pt_br: Texto não encontrado
ru: Текст не найден.
tr: Metin Bulunamadı.

source: Result copyed in clipboard.
ar: تم نسخ النتيجة إلى الحافظة
es: Resultado copiado en el portapapeles.\n
fi: Tulos kopioitu leikepöydälle.
ru: Результат скопирован в буфер обмена.
tr: Sonuç panoya kopyalandı.

source: Copy last result in clipboard.
ar: نسخ آخر نتيجة إلى الحافظة.
es: Copie el último resultado en el portapapeles.
fi: Kopioi viimeisin tulos leikepöydälle.
pt_br: Copiar resultado para área de transferência
ru: Копировать последний результат в буфер обмена.
tr: Son sonucu panoya kopyalar.

source: Ask the bot a question.
ar: اطرح سؤالاً على البوت.
fi: Esitä botille kysymys.
ru: &Задайте вопрос боту.
tr: Bot'a bir soru sorun.

source: Recognize mathematical formulas using Mathpix service. Opens virtual viewer automatically.
ar: التعرف على الصيغ الرياضية باستخدام خدمة Mathpix. يفتح العارض الافتراضي تلقائيًا.
es: Reconoce fórmulas matemáticas utilizando el servicio Mathpix. Abre el visor virtual automáticamente.
fi: Tunnistaa matemaattiset kaavat Mathpix-palvelua käyttäen. Tuloksen tarkastelua varten avataan automaattisesti virtuaalinen ikkuna.
pt_br: Reconhece fórmulas matemáticas usando o serviço Mathpix. Abre o visualizador virtual automaticamente.
ru: Распознавание математических формул с помощью сервиса Mathpix. Автоматически открывает виртуальный просмотрщик.
tr: Mathpix hizmetini kullanarak matematiksel formülleri tanır. Sanal görüntüleyiciyi otomatik olarak açar.

source: CloudVision
fi: Pilvinäkö

source: An extension for describing images by utilizing recent advances in AI technology. Press NVDA+Control+I to get a description of an object or selected file in Explorer, if you press twice quickly, a virtual viewer will open.
ar: إضافة لوصف الصور باستخدام أحدث التقنيات في تكنولوجيا الذكاء الاصطناعي. اضغط على NVDA+Control+I للحصول على وصف لكائن أو ملف محدد في مستكشف الملفات FileExplorer، وإذا قمت بالضغط مرتين بسرعة، سيتم فتح نافذة افتراضية تحتوي على النتيجة.
es: Una extensión para describir imágenes mediante la utilización de avances recientes en tecnología de inteligencia artificial. Presiona NVDA+Control+I para obtener una descripción de un objeto o archivo seleccionado en el Explorador, si presionas dos veces rápidamente, se abrirá un visor virtual.C
fi: Lisäosa, joka kuvailee kuvia tekoälyn viimeaikaista kehitystä hyödyntäen. Paina NVDA+Ctrl+I saadaksesi kuvauksen objektista tai Resurssienhallinnassa valittuna olevasta tiedostosta. Kahdesti painettaessa kuvaus avataan erilliseen ikkunaan.
pt_br: Um complemento para descrever imagens usando os recentes avanços da Inteligência Artificial; Pressione NVDA+Control+I para obter uma descrição de um objeto ou arquivo selecionado no Explorer, se você pressionar duas vezes rapidamente, um visualizador virtual irá abrir.
ru: Расширение Предоставляет описание того, как текущий объект навигатора выглядит визуально, если нажать два раза быстро, откроется виртуальный просмотрщик.
tr: AI teknolojisindeki son gelişmelerden yararlanarak görüntüleri tanımlamaya yönelik bir eklenti. Explorer'da bir nesnenin veya seçilen dosyanın açıklamasını almak için NVDA+Control+I tuşlarına basın, hızlıca iki kez basarsanız sanal bir görüntüleyici açılır.

source: Wait for the Be My Eyes to type the message
ar: انتظر حتى يقوم Be My Eyes بكتابة الرسالة
tr: Be My Eyes mesaj yazarken lütfen bekleyin

source: Gives a description on how current navigator object or selected file in Explorer looks like visually, if you press twice quickly, a virtual viewer will open.
ar: يقدم وصفًا بصريا لكيفية ظهور الكائن الحالي أو الملف المحدد في المستكشف، إذا قمت بالضغط مرتين بسرعة، سيتم فتح نافذة افتراضية تحتوي على النتيجة.
es: Proporciona una descripción de cómo se ve visualmente el objeto del navegador actual o el archivo seleccionado en el Explorador.\n si presionas dos veces rápidamente, se abrirá un visor virtual.
pt_br: Fornece uma descrição da aparência do objeto do navegador ou explorador atual, se pressionado duas vezes, um visualizador virtual aparece.
tr: Geçerli gezgin nesnesinin veya Explorer'da seçilen dosyanın görsel olarak nasıl göründüğüne ilişkin bir açıklama duyurur, hızlı bir şekilde iki kez basılırsa sanal bir görüntüleyici açılır.

source: Result copyed in clipboard.
pt_br: Resultado copiado para área de transferência
